<?php

// +----------------------------------------------------------------------
// | Simplestart Library
// +----------------------------------------------------------------------
// | 版权所有: http://www.simplestart.cn copyright 2020
// +----------------------------------------------------------------------
// | 开源协议: https://www.apache.org/licenses/LICENSE-2.0.txt
// +----------------------------------------------------------------------
// | 仓库地址: https://github.com/simplestart-cn/start-library
// +----------------------------------------------------------------------

return [
    'not_auth'       => '没有访问该操作的权限.',
    'not_login'      => '需要登录获取访问权限.',
    'create_success' => '数据保存成功.',
    'create_error'   => '数据保存失败, 请稍候再试~',
    'update_success' => '数据更新成功.',
    'update_error'   => '数据更新失败, 请稍候再试~',
    'remove_success' => '数据删除成功.',
    'remove_error'   => '数据删除失败, 请稍候再试~',
    'page_html'      => '共 %s 条记录，每页显示 %s 条，共 %s 页当前显示第 %s 页。',
    'csrf_error'     => '表单令牌验证失败，请刷新页面再试~',
    'method_limit'    => '仅限 %s 方法.'
];
